#ifndef	__replay_H__
#define	__replay_H__


//----------------------------------------------------------------------------
// リプレイ記録開始時のバッファーを初期化
//		heap	ヒープ領域を示す変数へのポインタ
extern	void	replay_record_init_buffer(void **heap);

//----------------------------------------------------------------------------
// リプレイ記録開始時の初期化
//		player	参加人数
extern	void	replay_record_init(int player);

//----------------------------------------------------------------------------
// リプレイデータの記録
//		player	プレイヤー番号
//		pad		パッドの状態
extern	int		replay_record(int player, u16 pad);

//----------------------------------------------------------------------------
// リプレイ再生開始時の初期化
extern	void	replay_play_init(void);

//----------------------------------------------------------------------------
// リプレイデータの取り出し
//		player	プレイヤー番号
// データが終わった場合 CONT_START を返す
extern	u16		replay_play(int player);


#endif
